app/controllers/api/events_controller.rb

    def index
        if params[:filter]
            filter = params[:filter]
            if filter[:searchParams]
                search_params = "%#{filter[:searchParams]}%"
                @events = Event.select("*").where("UPPER(title) LIKE UPPER(?) OR UPPER(description) LIKE UPPER(?)", search_params, search_params)
            end
        else
            @events = Event.all
---
SELECT  "events".* FROM "events" LIMIT $1  [["LIMIT", 11]]