app/controllers/api/events_controller.rb

    def update
        @event = Event.find(params[:id])
        if @event.update!(event_params)
---
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 35], ["LIMIT", 1]]
UPDATE "events" SET "updated_at" = $1 WHERE "events"."id" = $2  [["updated_at", "2020-08-02 02:15:30.214739"], ["id", 36]]

    def create
        @event = Event.create!(event_params)
---
INSERT INTO "events" ("host_id", "title", "description", "price", "location", "category", "max_attendees", "created_at", "updated_at", "event_start", "event_end", "event_start_time", "event_end_time") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"